DataProcessors/РегистрацияСводныхСправок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>РегистрацияСводныхСправок</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокПродажи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДокументПродажи</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ОтчетКомиссионераОПродажах</v8:Type>
								<v8:Type>cfg:DocumentRef.ОтчетОРозничныхПродажах</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СводнаяСправка</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.СчетФактураВыданный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СписокВозвраты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДокументПродажи</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ОтчетКомиссионераОПродажах</v8:Type>
								<v8:Type>cfg:DocumentRef.ОтчетОРозничныхПродажах</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументВозврата</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ОтчетКомиссионераОПродажах</v8:Type>
								<v8:Type>cfg:DocumentRef.ОтчетОРозничныхПродажах</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СводнаяСправка</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.СчетФактураВыданный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КорректировочнаяСводнаяСправка</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.СчетФактураВыданный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

AccumulationRegisters/НДСЗаписиКнигиПродаж.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>НДСЗаписиКнигиПродаж</Name>
			<Comment>НДС. Записи книги продаж</Comment>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаБезНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>НомерДокументаОплаты</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.НомерДокументаОплаты</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДокументаОплаты</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодВидаОперации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодОперации0</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>7</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НесырьевыеТовары</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСчетаФактурыНаАванс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСчетаФактурыНаАванс</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерИсправленияСчетаФактурыНаАванс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИсправленияСчетаФактурыНаАванс</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Покупатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетФактура</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СписаниеСРасчетногоСчета</v8:Type>
						<v8:Type>cfg:DocumentRef.ПередачаОС</v8:Type>
						<v8:Type>cfg:DocumentRef.АвансовыйОтчет</v8:Type>
						<v8:Type>cfg:DocumentRef.ГТДИмпорт</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаПоступления</v8:Type>
						<v8:Type>cfg:DocumentRef.ВыкупПредметовЛизинга</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетФактураВыданный</v8:Type>
						<v8:Type>cfg:DocumentRef.ДокументРасчетовСКонтрагентом</v8:Type>
						<v8:Type>cfg:DocumentRef.ПринятиеКУчетуОС</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеНаРасчетныйСчет</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаРеализации</v8:Type>
						<v8:Type>cfg:DocumentRef.НачислениеПеней</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.АктОбОказанииПроизводственныхУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаДолга</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ОказаниеУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.МодернизацияОС</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровОтПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ПередачаТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ОплатаПлатежнойКартой</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомиссионераОПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомитентуОПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетФактураПолученный</v8:Type>
						<v8:Type>cfg:DocumentRef.ПередачаНМА</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетОРозничныхПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеИзПереработки</v8:Type>
						<v8:Type>cfg:DocumentRef.ВосстановлениеНДС</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаявлениеОВвозеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияУслугПоПереработке</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтражениеНачисленияНДС</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтражениеНДСКВычету</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияОтгруженныхТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.НачислениеНДСпоСМРхозспособом</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеДопРасходов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЦенности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыЦенностей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаОплаты</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументОплаты</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СписаниеСРасчетногоСчета</v8:Type>
						<v8:Type>cfg:DocumentRef.ПередачаОС</v8:Type>
						<v8:Type>cfg:DocumentRef.АвансовыйОтчет</v8:Type>
						<v8:Type>cfg:DocumentRef.ГТДИмпорт</v8:Type>
						<v8:Type>cfg:DocumentRef.ВыкупПредметовЛизинга</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетФактураВыданный</v8:Type>
						<v8:Type>cfg:DocumentRef.ДокументРасчетовСКонтрагентом</v8:Type>
						<v8:Type>cfg:DocumentRef.ПринятиеКУчетуОС</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеНаРасчетныйСчет</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.ОперацияБух</v8:Type>
						<v8:Type>cfg:DocumentRef.АктОбОказанииПроизводственныхУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеНМА</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаДолга</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровОтПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ОплатаПлатежнойКартой</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомиссионераОПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомитентуОПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.ПередачаНМА</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетОРозничныхПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияУслугПоПереработке</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтражениеНачисленияНДС</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеДопРасходов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Событие</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СобытияПоНДСПродажи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаписьДополнительногоЛиста</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КорректируемыйПериод</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СторнирующаяЗаписьДопЛиста</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Comment>Договор контрагента (для СФ на аванс, нал.агента по 161.5)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИсправленныйСчетФактура</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.КорректировкаПоступления</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетФактураВыданный</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаРеализации</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетФактураПолученный</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

DataProcessors/РегистрацияСводныхСправок/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Формирует сводные справки при вызове из обработки "Помощник расчета НДС"
// Параметры:
//  СтруктураПараметров - Структура - см. ПараметрыЗаполнения()
//
Процедура СформироватьСводныеСправкиВПомощнике(СтруктураПараметров) Экспорт
	
	ДанныеСписков  = ЗаполнитьСтроки(СтруктураПараметров);
	СписокПродажи  = ДанныеСписков.СписокПродажи;
	СписокВозвраты = ДанныеСписков.СписокВозвраты;
	
	ВыполнитьФормированиеСводныхСправок(СтруктураПараметров, СписокПродажи, СписокВозвраты);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ВыполнитьФормированиеСводныхСправок(СтруктураПараметров, СписокПродажи, СписокВозвраты)
	
	ЗапросПродажи = Новый Запрос;
	ЗапросПродажи.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_Таблица.ДокументПродажи КАК ДокументПродажи,
	|	ВТ_Таблица.СводнаяСправка КАК СводнаяСправка
	|ПОМЕСТИТЬ ВТ_Таблица
	|ИЗ
	|	&ВТ_Таблица КАК ВТ_Таблица
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ВТ_Таблица.ДокументПродажи ССЫЛКА Документ.ОтчетКомиссионераОПродажах
	|			ТОГДА ВЫРАЗИТЬ(ВТ_Таблица.ДокументПродажи КАК Документ.ОтчетКомиссионераОПродажах)
	|		КОГДА ВТ_Таблица.ДокументПродажи ССЫЛКА Документ.ОтчетОРозничныхПродажах
	|			ТОГДА ВЫРАЗИТЬ(ВТ_Таблица.ДокументПродажи КАК Документ.ОтчетОРозничныхПродажах)
	|	КОНЕЦ КАК ДокументПродажи,
	|	ВТ_Таблица.СводнаяСправка КАК СводнаяСправка
	|ПОМЕСТИТЬ ВТ_Данные
	|ИЗ
	|	ВТ_Таблица КАК ВТ_Таблица
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА (ВЫРАЗИТЬ(&Периодичность КАК Перечисление.ДоступныеПериодыОтчета)) = ЗНАЧЕНИЕ(Перечисление.ДоступныеПериодыОтчета.Месяц)
	|			ТОГДА КОНЕЦПЕРИОДА(ВТ_Данные.ДокументПродажи.Дата, МЕСЯЦ)
	|		ИНАЧЕ КОНЕЦПЕРИОДА(ВТ_Данные.ДокументПродажи.Дата, КВАРТАЛ)
	|	КОНЕЦ КАК ДатаПериода,
	|	ВТ_Данные.СводнаяСправка КАК СводнаяСправка,
	|	ВТ_Данные.ДокументПродажи КАК ДокументПродажи
	|ИЗ
	|	ВТ_Данные КАК ВТ_Данные
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаПериода
	|ИТОГИ ПО
	|	ДатаПериода,
	|	СводнаяСправка";
	
	ЗапросПродажи.УстановитьПараметр("ВТ_Таблица",    СписокПродажи);
	ЗапросПродажи.УстановитьПараметр("Периодичность", СтруктураПараметров.ПериодичностьРегистрации);
	
	РезультатЗапроса = ЗапросПродажи.Выполнить();
	
	ВыборкаДатаПериода = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаДатаПериода.Следующий() Цикл
		
		ВыборкаСводныеСправки = ВыборкаДатаПериода.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаСводныеСправки.Следующий() Цикл
			
			МассивСтрокСпискаПродажи       = Новый Массив;
			МассивСтрокСпискаКорректировка = Новый Массив;
			
			Если ЗначениеЗаполнено(ВыборкаСводныеСправки.СводнаяСправка) Тогда
				ДокументСводнойСправки = ВыборкаСводныеСправки.СводнаяСправка.ПолучитьОбъект();
				ДокументСводнойСправки.ДокументыОснования.Очистить();
			Иначе
				ДокументСводнойСправки = Документы.СчетФактураВыданный.СоздатьДокумент();
			КонецЕсли;
			
			ДокументСводнойСправки.Дата 			= ВыборкаДатаПериода.ДатаПериода;
			ДокументСводнойСправки.КодВидаОперации 	= 26;
			
			ДанныеЗаполнения = Новый Структура;
			ДанныеЗаполнения.Вставить("ВидСчетаФактуры", 	Перечисления.ВидСчетаФактурыВыставленного.СводнаяСправка);
			ДанныеЗаполнения.Вставить("Организация", 		СтруктураПараметров.Организация);
				
			ЗаполнениеДокументов.Заполнить(ДокументСводнойСправки, ДанныеЗаполнения);
			
			ВыборкаДетальныеЗаписи = ВыборкаСводныеСправки.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				
				СтрокаОснования = ДокументСводнойСправки.ДокументыОснования.Добавить();
				СтрокаОснования.ДокументОснование = ВыборкаДетальныеЗаписи.ДокументПродажи;
				
				СтрокиСпискаПродажи = СписокПродажи.НайтиСтроки(Новый Структура("ДокументПродажи", ВыборкаДетальныеЗаписи.ДокументПродажи));
				Для Каждого СтрокаСпискаПродажи Из СтрокиСпискаПродажи Цикл
					МассивСтрокСпискаПродажи.Добавить(СтрокаСпискаПродажи);
				КонецЦикла;
				
				СтрокиСпискаКорректировка = СписокВозвраты.НайтиСтроки(Новый Структура("ДокументПродажи", ВыборкаДетальныеЗаписи.ДокументПродажи));
				Для Каждого СтрокаСпискаКорректировка Из СтрокиСпискаКорректировка Цикл
					МассивСтрокСпискаКорректировка.Добавить(СтрокаСпискаКорректировка);
				КонецЦикла;
				
			КонецЦикла;
			
			ДокументСводнойСправки.ОпределениеПараметровСводнойИКорректировочнойСправки();
			ДокументСводнойСправки.Записать(РежимЗаписиДокумента.Проведение);
			
			Для Каждого СтрокаСписка Из МассивСтрокСпискаПродажи Цикл
				СтрокаСписка.СводнаяСправка = ДокументСводнойСправки.Ссылка;
			КонецЦикла;
			
			Для Каждого СтрокаСписка Из МассивСтрокСпискаКорректировка Цикл
				СтрокаСписка.СводнаяСправка = ДокументСводнойСправки.Ссылка;
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;
	
	ЗапросВозвраты = Новый Запрос;
	ЗапросВозвраты.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_Таблица.ДокументПродажи КАК ДокументПродажи,
	|	ВТ_Таблица.ДокументВозврата КАК ДокументВозврата,
	|	ВТ_Таблица.СводнаяСправка КАК СводнаяСправка,
	|	ВТ_Таблица.КорректировочнаяСводнаяСправка КАК КорректировочнаяСводнаяСправка
	|ПОМЕСТИТЬ ВТ_ТаблицаКорректировки
	|ИЗ
	|	&ВТ_Таблица КАК ВТ_Таблица
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТаблицаКорректировки.ДокументПродажи КАК ДокументПродажи,
	|	ВЫБОР
	|		КОГДА ВТ_ТаблицаКорректировки.ДокументВозврата ССЫЛКА Документ.ОтчетКомиссионераОПродажах
	|			ТОГДА ВЫРАЗИТЬ(ВТ_ТаблицаКорректировки.ДокументВозврата КАК Документ.ОтчетКомиссионераОПродажах)
	|		КОГДА ВТ_ТаблицаКорректировки.ДокументВозврата ССЫЛКА Документ.ОтчетОРозничныхПродажах
	|			ТОГДА ВЫРАЗИТЬ(ВТ_ТаблицаКорректировки.ДокументВозврата КАК Документ.ОтчетОРозничныхПродажах)
	|	КОНЕЦ КАК ДокументВозврата,
	|	ВЫРАЗИТЬ(ВТ_ТаблицаКорректировки.СводнаяСправка КАК Документ.СчетФактураВыданный) КАК СводнаяСправка,
	|	ВТ_ТаблицаКорректировки.КорректировочнаяСводнаяСправка КАК КорректировочнаяСводнаяСправка
	|ПОМЕСТИТЬ ВТ_Данные
	|ИЗ
	|	ВТ_ТаблицаКорректировки КАК ВТ_ТаблицаКорректировки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА (ВЫРАЗИТЬ(&Периодичность КАК Перечисление.ДоступныеПериодыОтчета)) = ЗНАЧЕНИЕ(Перечисление.ДоступныеПериодыОтчета.Месяц)
	|			ТОГДА КОНЕЦПЕРИОДА(ВТ_Данные.ДокументВозврата.Дата, МЕСЯЦ)
	|		ИНАЧЕ КОНЕЦПЕРИОДА(ВТ_Данные.ДокументВозврата.Дата, КВАРТАЛ)
	|	КОНЕЦ КАК ДатаПериода,
	|	ВТ_Данные.ДокументПродажи КАК ДокументПродажи,
	|	ВТ_Данные.ДокументВозврата КАК ДокументВозврата,
	|	ВТ_Данные.СводнаяСправка КАК СводнаяСправка,
	|	ВТ_Данные.КорректировочнаяСводнаяСправка КАК КорректировочнаяСводнаяСправка,
	|	ВТ_Данные.СводнаяСправка.ПредставлениеНомера КАК НомерИсходногоДокумента,
	|	ВТ_Данные.СводнаяСправка.Дата КАК ДатаИсходногоДокумента
	|ИЗ
	|	ВТ_Данные КАК ВТ_Данные
	|ГДЕ
	|	ВТ_Данные.СводнаяСправка <> ЗНАЧЕНИЕ(Документ.СчетФактураВыданный.ПустаяСсылка)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаПериода
	|ИТОГИ ПО
	|	ДатаПериода,
	|	СводнаяСправка,
	|	КорректировочнаяСводнаяСправка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Данные.СводнаяСправка КАК СводнаяСправка,
	|	ВТ_Данные.СводнаяСправка.ПредставлениеНомера КАК НомерИсходногоДокумента,
	|	ВТ_Данные.СводнаяСправка.Дата КАК ДатаИсходногоДокумента
	|ИЗ
	|	ВТ_Данные КАК ВТ_Данные
	|ГДЕ
	|	ВТ_Данные.СводнаяСправка <> ЗНАЧЕНИЕ(Документ.СчетФактураВыданный.ПустаяСсылка)";
	
	ЗапросВозвраты.УстановитьПараметр("ВТ_Таблица",    СписокВозвраты);
	ЗапросВозвраты.УстановитьПараметр("Периодичность", СтруктураПараметров.ПериодичностьРегистрации);
	
	РезультатЗапроса = ЗапросВозвраты.ВыполнитьПакет();
	
	ВыборкаДатаПериода = РезультатЗапроса[2].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаИнформацияПоСводнымСправкам = РезультатЗапроса[3].Выбрать();
	
	Пока ВыборкаДатаПериода.Следующий() Цикл
		
		ВыборкаСводнаяСправка = ВыборкаДатаПериода.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаСводнаяСправка.Следующий() Цикл
			
			ВыборкаКорректировочнаяСводнаяСправка = ВыборкаСводнаяСправка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока ВыборкаКорректировочнаяСводнаяСправка.Следующий() Цикл
				
				МассивСтрокСпискаВозвраты = Новый Массив;
				
				Если ЗначениеЗаполнено(ВыборкаКорректировочнаяСводнаяСправка.КорректировочнаяСводнаяСправка) Тогда
					ДокументКорректировкиСводнойСправки = ВыборкаКорректировочнаяСводнаяСправка.КорректировочнаяСводнаяСправка.ПолучитьОбъект();
					ДокументКорректировкиСводнойСправки.ДокументыОснования.Очистить();
				Иначе
					ДокументКорректировкиСводнойСправки = Документы.СчетФактураВыданный.СоздатьДокумент();
				КонецЕсли;
				
				ДокументКорректировкиСводнойСправки.Дата                        = ВыборкаДатаПериода.ДатаПериода;
				ДокументКорректировкиСводнойСправки.ИсправляемыйСчетФактура     = ВыборкаСводнаяСправка.СводнаяСправка;
				ДокументКорректировкиСводнойСправки.КодВидаОперации             = 17;
				ДокументКорректировкиСводнойСправки.КодСпособаВыставления       = 1;
				
				ДанныеЗаполнения = Новый Структура;
				ДанныеЗаполнения.Вставить("ВидСчетаФактуры", 	Перечисления.ВидСчетаФактурыВыставленного.КорректировочнаяСправка);
				ДанныеЗаполнения.Вставить("Организация",		СтруктураПараметров.Организация);
				
				ЗаполнениеДокументов.Заполнить(ДокументКорректировкиСводнойСправки, ДанныеЗаполнения);
				
				ВыборкаИнформацияПоСводнымСправкам.Сбросить();
				
				СтруктураПоиска = Новый Структура;
				СтруктураПоиска.Вставить("СводнаяСправка", ВыборкаСводнаяСправка.СводнаяСправка);
				
				Если ВыборкаИнформацияПоСводнымСправкам.НайтиСледующий(СтруктураПоиска) Тогда
					ДокументКорректировкиСводнойСправки.ДатаИсходногоДокумента  = ВыборкаИнформацияПоСводнымСправкам.ДатаИсходногоДокумента;
					ДокументКорректировкиСводнойСправки.НомерИсходногоДокумента = ВыборкаИнформацияПоСводнымСправкам.НомерИсходногоДокумента;
				КонецЕсли;
				
				ВыборкаДетальныеЗаписи = ВыборкаКорректировочнаяСводнаяСправка.Выбрать();
				
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					
					СтрокаОснования = ДокументКорректировкиСводнойСправки.ДокументыОснования.Добавить();
					СтрокаОснования.ДокументОснование = ВыборкаДетальныеЗаписи.ДокументВозврата;
					
					СтруктураОтбора = Новый Структура;
					СтруктураОтбора.Вставить("ДокументПродажи", 	ВыборкаДетальныеЗаписи.ДокументПродажи);
					СтруктураОтбора.Вставить("ДокументВозврата", 	ВыборкаДетальныеЗаписи.ДокументВозврата);
					
					СтрокиСпискаВозвраты = СписокВозвраты.НайтиСтроки(СтруктураОтбора);
					
					Для Каждого СтрокаСпискаВозвраты Из СтрокиСпискаВозвраты Цикл
						МассивСтрокСпискаВозвраты.Добавить(СтрокаСпискаВозвраты);
					КонецЦикла;
					
				КонецЦикла;
				
				ДокументКорректировкиСводнойСправки.ОпределениеПараметровСводнойИКорректировочнойСправки();
				ДокументКорректировкиСводнойСправки.Записать(РежимЗаписиДокумента.Проведение);
				
				Для Каждого СтрокаСпискаВозвраты Из МассивСтрокСпискаВозвраты Цикл
					СтрокаСпискаВозвраты.КорректировочнаяСводнаяСправка = ДокументКорректировкиСводнойСправки.Ссылка;
				КонецЦикла;
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;

КонецПроцедуры

// Подготавливает данные для заполнения табличных частей на форме
// Параметры:
//  СтруктураПараметров - Структура - см. ПараметрыЗаполнения()
//	АдресХранилища  - Строка - адрес хранилища результата
//
Процедура ПодготовитьДанныеДляЗаполнения(СтруктураПараметров, АдресХранилища) Экспорт

	ДанныеДляЗаполнения = Новый Структура;

	Сведения = ЗаполнитьСтроки(СтруктураПараметров);
	ДанныеДляЗаполнения.Вставить("СписокПродажи",  Сведения.СписокПродажи);
	ДанныеДляЗаполнения.Вставить("СписокВозвраты", Сведения.СписокВозвраты);

	ПоместитьВоВременноеХранилище(ДанныеДляЗаполнения, АдресХранилища);

КонецПроцедуры

// Формирует сведения для заполнения табличных частей на форме
// Параметры:
//  СтруктураПараметров - Структура - см. ПараметрыЗаполнения()
// Возвращаемое значение:
//  - Структура
//
Функция ЗаполнитьСтроки(СтруктураПараметров) Экспорт
	
	ЗапросСводныхСправок = Новый Запрос;
	ЗапросСводныхСправок.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НДСЗаписиКнигиПродажОбороты.Период КАК Период,
	|	НДСЗаписиКнигиПродажОбороты.СчетФактура КАК ДокументПродажи,
	|	НДСЗаписиКнигиПродажОбороты.ДатаСобытия КАК ДатаСобытия,
	|	НДСЗаписиКнигиПродажОбороты.СуммаБезНДСОборот КАК СуммаБезНДС,
	|	НДСЗаписиКнигиПродажОбороты.НДСОборот КАК СуммаНДС,
	|	НДСЗаписиКнигиПродажОбороты.СчетФактура.Контрагент КАК Контрагент,
	|	ИСТИНА КАК ЭтоОтчетКомиссионера
	|ПОМЕСТИТЬ ВТ_КнигаПродаж
	|ИЗ
	|	РегистрНакопления.НДСЗаписиКнигиПродаж.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			Регистратор,
	|			Организация = &Организация
	|				И Событие = ЗНАЧЕНИЕ(Перечисление.СобытияПоНДСПродажи.Реализация)
	|				И ЗаписьДополнительногоЛиста = ЛОЖЬ) КАК НДСЗаписиКнигиПродажОбороты
	|ГДЕ
	|	НДСЗаписиКнигиПродажОбороты.СчетФактура ССЫЛКА Документ.ОтчетКомиссионераОПродажах
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НДСЗаписиКнигиПродажОбороты.Период,
	|	НДСЗаписиКнигиПродажОбороты.СчетФактура,
	|	НДСЗаписиКнигиПродажОбороты.ДатаСобытия,
	|	НДСЗаписиКнигиПродажОбороты.СуммаБезНДСОборот,
	|	НДСЗаписиКнигиПродажОбороты.НДСОборот,
	|	ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка),
	|	ЛОЖЬ
	|ИЗ
	|	РегистрНакопления.НДСЗаписиКнигиПродаж.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			Регистратор,
	|			Организация = &Организация
	|				И Событие = ЗНАЧЕНИЕ(Перечисление.СобытияПоНДСПродажи.Реализация)
	|				И ЗаписьДополнительногоЛиста = ЛОЖЬ) КАК НДСЗаписиКнигиПродажОбороты
	|ГДЕ
	|	НДСЗаписиКнигиПродажОбороты.СчетФактура ССЫЛКА Документ.ОтчетОРозничныхПродажах
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДокументПродажи
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_КнигаПродаж.ДокументПродажи КАК ДокументПродажи,
	|	ВТ_КнигаПродаж.ДатаСобытия КАК ДатаСобытия,
	|	ВТ_КнигаПродаж.Контрагент КАК Контрагент,
	|	ВТ_КнигаПродаж.СуммаБезНДС + ВТ_КнигаПродаж.СуммаНДС КАК Сумма,
	|	ВТ_КнигаПродаж.СуммаНДС КАК СуммаНДС,
	|	ЕСТЬNULL(СчетФактураВыданныйДокументыОснования.Ссылка, ЗНАЧЕНИЕ(Документ.СчетФактураВыданный.ПустаяСсылка)) КАК СводнаяСправка,
	|	ВТ_КнигаПродаж.ЭтоОтчетКомиссионера КАК ЭтоОтчетКомиссионера
	|ИЗ
	|	ВТ_КнигаПродаж КАК ВТ_КнигаПродаж
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный.ДокументыОснования КАК СчетФактураВыданныйДокументыОснования
	|		ПО ВТ_КнигаПродаж.ДокументПродажи = СчетФактураВыданныйДокументыОснования.ДокументОснование.Ссылка
	|			И (СчетФактураВыданныйДокументыОснования.Ссылка.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.СводнаяСправка))
	|			И (НЕ СчетФактураВыданныйДокументыОснования.Ссылка.ПометкаУдаления)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВТ_КнигаПродаж.Период";
	
	ЗапросСводныхСправок.УстановитьПараметр("НачалоПериода",   СтруктураПараметров.НачалоПериода);
	ЗапросСводныхСправок.УстановитьПараметр("КонецПериода",    КонецДня(СтруктураПараметров.КонецПериода));
	ЗапросСводныхСправок.УстановитьПараметр("Организация",     СтруктураПараметров.Организация);
	
	ТаблицаРезультатаСводныхСправок = ЗапросСводныхСправок.Выполнить().Выгрузить();
	
	ЗапросКорректирующихСправок = Новый Запрос;
	ЗапросКорректирующихСправок.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НДСЗаписиКнигиПокупокОбороты.Период КАК Период,
	|	НДСЗаписиКнигиПокупокОбороты.СчетФактура КАК ДокументПродажи,
	|	НДСЗаписиКнигиПокупокОбороты.Регистратор КАК ДокументВозврата,
	|	НДСЗаписиКнигиПокупокОбороты.СуммаБезНДСОборот + НДСЗаписиКнигиПокупокОбороты.НДСОборот КАК Сумма,
	|	НДСЗаписиКнигиПокупокОбороты.НДСОборот КАК СуммаНДС,
	|	ИСТИНА КАК ЭтоОтчетКомиссионера
	|ПОМЕСТИТЬ ВТ_ДокументыВозврата
	|ИЗ
	|	РегистрНакопления.НДСЗаписиКнигиПокупок.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			Регистратор,
	|			Организация = &Организация
	|				И ВидЦенности = ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.Возврат)
	|				И ЗаписьДополнительногоЛиста = ЛОЖЬ) КАК НДСЗаписиКнигиПокупокОбороты
	|ГДЕ
	|	НДСЗаписиКнигиПокупокОбороты.СчетФактура ССЫЛКА Документ.ОтчетКомиссионераОПродажах
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НДСЗаписиКнигиПокупокОбороты.Период,
	|	НДСЗаписиКнигиПокупокОбороты.СчетФактура,
	|	НДСЗаписиКнигиПокупокОбороты.Регистратор,
	|	НДСЗаписиКнигиПокупокОбороты.СуммаБезНДСОборот + НДСЗаписиКнигиПокупокОбороты.НДСОборот,
	|	НДСЗаписиКнигиПокупокОбороты.НДСОборот,
	|	ЛОЖЬ
	|ИЗ
	|	РегистрНакопления.НДСЗаписиКнигиПокупок.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			Регистратор,
	|			Организация = &Организация
	|				И ВидЦенности = ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.Возврат)
	|				И ЗаписьДополнительногоЛиста = ЛОЖЬ) КАК НДСЗаписиКнигиПокупокОбороты
	|ГДЕ
	|	НДСЗаписиКнигиПокупокОбороты.СчетФактура ССЫЛКА Документ.ОтчетОРозничныхПродажах
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДокументВозврата,
	|	ДокументПродажи
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДокументыВозврата.Период КАК Период,
	|	ВТ_ДокументыВозврата.ДокументПродажи КАК ДокументПродажи,
	|	ВТ_ДокументыВозврата.ДокументВозврата КАК ДокументВозврата,
	|	ЕСТЬNULL(СчетФактураВыданныйДокументыОснованияДокументРеализации.Ссылка, ЗНАЧЕНИЕ(Документ.СчетФактураВыданный.ПустаяСсылка)) КАК СводнаяСправка,
	|	ЕСТЬNULL(СчетФактураВыданныйДокументыОснованияДокументВозврата.Ссылка, ЗНАЧЕНИЕ(Документ.СчетФактураВыданный.ПустаяСсылка)) КАК КорректировочнаяСводнаяСправка,
	|	ЕСТЬNULL(ВТ_ДокументыВозврата.ДокументПродажи.Контрагент, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) КАК Контрагент,
	|	ВТ_ДокументыВозврата.ЭтоОтчетКомиссионера КАК ЭтоОтчетКомиссионера,
	|	СУММА(ВТ_ДокументыВозврата.Сумма) КАК Сумма,
	|	СУММА(ВТ_ДокументыВозврата.СуммаНДС) КАК СуммаНДС
	|ИЗ
	|	ВТ_ДокументыВозврата КАК ВТ_ДокументыВозврата
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный.ДокументыОснования КАК СчетФактураВыданныйДокументыОснованияДокументРеализации
	|		ПО ВТ_ДокументыВозврата.ДокументПродажи = СчетФактураВыданныйДокументыОснованияДокументРеализации.ДокументОснование.Ссылка
	|			И (СчетФактураВыданныйДокументыОснованияДокументРеализации.Ссылка.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.СводнаяСправка))
	|			И (НЕ СчетФактураВыданныйДокументыОснованияДокументРеализации.Ссылка.ПометкаУдаления)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный.ДокументыОснования КАК СчетФактураВыданныйДокументыОснованияДокументВозврата
	|		ПО ВТ_ДокументыВозврата.ДокументВозврата = СчетФактураВыданныйДокументыОснованияДокументВозврата.ДокументОснование.Ссылка
	|			И (СчетФактураВыданныйДокументыОснованияДокументВозврата.Ссылка.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.КорректировочнаяСправка))
	|			И (НЕ СчетФактураВыданныйДокументыОснованияДокументВозврата.Ссылка.ПометкаУдаления)
	|			И (СчетФактураВыданныйДокументыОснованияДокументВозврата.Ссылка.ИсправляемыйСчетФактура = СчетФактураВыданныйДокументыОснованияДокументРеализации.Ссылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ДокументыВозврата.ДокументПродажи,
	|	СчетФактураВыданныйДокументыОснованияДокументРеализации.Ссылка,
	|	СчетФактураВыданныйДокументыОснованияДокументВозврата.Ссылка,
	|	ЕСТЬNULL(ВТ_ДокументыВозврата.ДокументПродажи.Контрагент, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)),
	|	ВТ_ДокументыВозврата.ДокументВозврата,
	|	ВТ_ДокументыВозврата.ЭтоОтчетКомиссионера,
	|	ВТ_ДокументыВозврата.Период
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период";
	
	ЗапросКорректирующихСправок.УстановитьПараметр("НачалоПериода",   СтруктураПараметров.НачалоПериода);
	ЗапросКорректирующихСправок.УстановитьПараметр("КонецПериода",    КонецДня(СтруктураПараметров.КонецПериода));
	ЗапросКорректирующихСправок.УстановитьПараметр("Организация",     СтруктураПараметров.Организация);
	
	ТаблицаРезультатаКорректирующихСводныхСправок = ЗапросКорректирующихСправок.Выполнить().Выгрузить();
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("СписокПродажи",  ТаблицаРезультатаСводныхСправок);
	СтруктураВозврата.Вставить("СписокВозвраты", ТаблицаРезультатаКорректирующихСводныхСправок);
	
	Возврат СтруктураВозврата;

КонецФункции

// Формирует сводные справки при вызове из формы обработки
// Параметры:
//   СтруктураПараметров - Структура - см. ПараметрыЗаполнения()
// 	 АдресХранилища  - Строка - адрес хранилища результата
//
Процедура СформироватьСводныеСправки(СтруктураПараметров, АдресХранилища) Экспорт

	СписокПродажи   = СтруктураПараметров.ТаблицыДокументов.СписокПродажи;
	СписокВозвраты  = СтруктураПараметров.ТаблицыДокументов.СписокВозвраты;
	
	ВыполнитьФормированиеСводныхСправок(СтруктураПараметров, СписокПродажи, СписокВозвраты);

	ДанныеДляЗаполнения = Новый Структура;
	ДанныеДляЗаполнения.Вставить("СписокПродажи",  СписокПродажи);
	ДанныеДляЗаполнения.Вставить("СписокВозвраты", СписокВозвраты);

	ПоместитьВоВременноеХранилище(ДанныеДляЗаполнения, АдресХранилища);

КонецПроцедуры

#КонецОбласти

#КонецЕсли
